Revit 2024 API
PhotometricWebLightDistribution Members
The PhotometricWebLightDistribution type exposes the following members.
Constructors
Name | Description
PhotometricWebLightDistribution(PhotometricWebLightDistribution)
 Creates a copy of the given photometric web light distribution
PhotometricWebLightDistribution(String, Double)
 Creates a photometric web light distribution object with the given filename and tilt.
Methods
Name | Description
Clone
 Creates a copy of the LightDistribution derived object.
 (Inherited from LightDistribution.)
Dispose |  (Inherited from LightDistribution.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from LightDistribution.)
PhotometricWebFile
 The filename of an IES photometric web file.
TiltAngle
 The tilt angle.
See Also
PhotometricWebLightDistribution Class
Autodesk.Revit.DB.Lighting Namespace